"""
Невзвешенный ориентированный граф задан своей матрицей смежности. 
Требуется построить его транзитивное замыкание, то есть матрицу, в которой в 𝑖-й строке и 𝑗-м столбце находится 1, 
если от вершины 𝑖 можно добраться до вершины 𝑗, и 0 - иначе.

Входные данные
В первой строке дано число 𝑁 (1≤𝑁≤100) - число вершин в графе. Далее задана матрица смежности графа: 
в 𝑁 строках даны по 𝑁 чисел 0 или 1 в каждой. 𝑖-е число в 𝑖-й строке всегда равно 1.

Выходные данные
Необходимо вывести матрицу транзитивного замыкания графа в формате, аналогичным формату матрицы смежности.
"""

def floyd_warshall(graph, n):
    matrix = [row[:] for row in graph]

    for k in range(n):
        for i in range(n):
            for j in range(n):
                if matrix[i][k] != 0 and matrix[k][j] != 0:
                    matrix[i][j] = 1
    return matrix


n = int(input())
graph = [[int(i) for i in input().split()] for _ in range(n)]

matrix = floyd_warshall(graph, n)

for row in matrix:
    print(*row)