"""
Неориентированный граф с кратными рёбрами называется полным, 
если любая пара его различных вершин соединена хотя бы одним ребром. 
Для заданного списком ребер графа проверьте, является ли он полным.

Входные данные
Сначала вводятся числа n ( 1≤𝑛≤100 ) – количество вершин в графе и m ( 1≤𝑚≤𝑛(𝑛−1)/2 ) – количество ребер. 
Затем следует m пар чисел – ребра графа.

Выходные данные
Выведите  «YES», если граф является полным, и «NO» в противном случае.
"""

n, m = map(int, input().split())
edges = []
for _ in range(m):
    edges.append(tuple(map(int, input().split())))

edge_set = set()

for u, v in edges:
    if u != v:
        edge_set.add((min(u, v), max(u, v)))

if len(edge_set) == n * (n - 1) // 2:
    print("YES")
else:
    print("NO")