/*
Мальчик подошел к платной лестнице.
Чтобы наступить на любую ступеньку, нужно заплатить указанную на ней сумму.
Мальчик умеет перешагивать на следующую ступеньку, либо перепрыгивать через ступеньку.
Требуется узнать, какая наименьшая сумма понадобится мальчику, чтобы добраться до верхней ступеньки.

Входные данные
В первой строке входного файла вводится одно натуральное число 𝑁≤100 — количество ступенек.
В следующей строке вводятся 𝑁 натуральных чисел, не превосходящих 100 — стоимость каждой ступеньки (снизу вверх).

Выходные данные
Выведите одно число — наименьшую возможную стоимость прохода по лесенке.
*/


#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n;
    cin >> n;
    vector<int> dp(n), cost(n);
    for (int i = 0; i < n; ++i)
        cin >> cost[i];

    dp[0] = cost[0];
    dp[1] = cost[1];

    for (int i = 2; i < n; ++i)
        dp[i] = min(dp[i - 1], dp[i - 2]) + cost[i];

    cout << dp[n - 1] << endl;
    return 0;
}
